Infineon/mtb-example-psoc4-msclp-capsense-lp-proximity/main.c
/*******************************************************************************
* Function Prototypes
*******************************************************************************/
static void InitializeCapsense(void);
static void Capsense_Msc0Isr(void);

static void Ezi2cIsr(void);
static void InitializeCapsenseTuner(void);

#if ENABLE_RUN_TIME_MEASUREMENT
static void StartRuntimeMeasurement();
static uint32_t StopRuntimeMeasurement();
#endif

#if ENABLE_SPI_SERIAL_LED
void UpdateLeds(void);
#endif

void RegisterCallback(void);

/* Deep Sleep Callback function */
cy_en_syspm_status_t DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams,
                                         cy_en_syspm_callback_mode_t mode);

/*******************************************************************************
* Global Definitions
*******************************************************************************/
/* Variables holds the current low power state [ACTIVE, ALR or WOT] */
APPLICATION_STATE appState;

cy_stc_scb_ezi2c_context_t ezi2cContext;

#if ENABLE_SPI_SERIAL_LED
extern cy_stc_scb_spi_context_t UserSpiContext;
extern serialLedContext_t ledContext;
#endif

/* Callback parameters for custom, EzI2C, SPI */

/* Callback parameters for EzI2C */
cy_stc_syspm_callback_params_t ezi2cCallbackParams =
{
    .base       = SCB1,
    .context    = &ezi2cContext
};

#if ENABLE_SPI_SERIAL_LED
/* Callback parameters for SPI */
cy_stc_syspm_callback_params_t spiCallbackParams =
{
    .base       = SCB0,
    .context    = &UserSpiContext
};
#endif

/* Callback parameters for custom callback */
cy_stc_syspm_callback_params_t deepSleepCallBackParams = {
    .base       =  NULL,
    .context    =  NULL
};

/* Callback declaration for EzI2C Deep Sleep callback */
cy_stc_syspm_callback_t ezi2cCallback =
{
    .callback       = (Cy_SysPmCallback)&Cy_SCB_EZI2C_DeepSleepCallback,
    .type           = CY_SYSPM_DEEPSLEEP,
    .skipMode       = 0UL,
    .callbackParams = &ezi2cCallbackParams,
    .prevItm        = NULL,
    .nextItm        = NULL,
    .order          = 0
};

#if ENABLE_SPI_SERIAL_LED
/* Callback declaration for SPI Deep Sleep callback */
cy_stc_syspm_callback_t spiCallback =
{
    .callback       = (Cy_SysPmCallback)&Cy_SCB_SPI_DeepSleepCallback,
    .type           = CY_SYSPM_DEEPSLEEP,
    .skipMode       = 0UL,
    .callbackParams = &spiCallbackParams,
    .prevItm        = NULL,
    .nextItm        = NULL,
    .order          = 1
};
#endif

/* Callback declaration for Custom Deep Sleep callback */
cy_stc_syspm_callback_t deepSleepCb =
{
    .callback       = &DeepSleepCallback,
    .type           = CY_SYSPM_DEEPSLEEP,
    .skipMode       = 0UL,
    .callbackParams = &deepSleepCallBackParams,
    .prevItm        = NULL,
    .nextItm        = NULL,
    .order          = 2
};

#if ENABLE_RUN_TIME_MEASUREMENT
volatile uint32_t processTime = 0u;
#endif

/*******************************************************************************
* Function Name: main
********************************************************************************
* Summary:
*  System entrance point. This function performs
*  - initial setup of device
*  - initialize CAPSENSE
*  - initialize tuner communication
*  - scan proximity and touch continuously at 3 different power modes
*  - serial RGB LED for proximity and touch indication
*
* Return:
*  int
*
*******************************************************************************/
int main(void)
{
    cy_rslt_t result;
    uint32_t appStateTimeoutCount;
    uint32_t interruptStatus;

#if ENABLE_RUN_TIME_MEASUREMENT
    static uint32_t activeModeRunTime;
    static uint32_t alrModeRunTime;
#endif

    /* Initialize the device and board peripherals */
    result = cybsp_init() ;

#if ENABLE_RUN_TIME_MEASUREMENT
    Cy_SysTick_Init (CY_SYSTICK_CLOCK_SOURCE_CLK_CPU ,SYS_TICK_MAX_INTERVAL);
#endif

    /* Board init failed. Stop program execution */
    if (result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(CY_ASSERT_FAILED);
    }

    /* Enable global interrupts */
    __enable_irq();

    /* Initialize EZI2C */
    InitializeCapsenseTuner();

#if ENABLE_SPI_SERIAL_LED
    /* Initialize SPI master */
    result = InitSpiMaster();
    /* Initialization failed. Stop program execution */
    if(result != INIT_SUCCESS)
    {
        CY_ASSERT(0);
    }
#else
    /* SPI pins drive mode to Analog HighZ */
    Cy_GPIO_SetDrivemode(CYBSP_SERIAL_LED_PORT, CYBSP_SERIAL_LED_NUM, CY_GPIO_DM_ANALOG);
#endif

    /* Register callbacks */
    RegisterCallback();

    /* Define initial state of the device and the corresponding refresh rate*/
    appState = ACTIVE_MODE;
    appStateTimeoutCount = 0u;

    /* Initialize MSC CAPSENSE */
    InitializeCapsense();

#if ENABLE_SPI_SERIAL_LED
    /* Serial LED control for showing the CAPSENSE touch status and power mode */
    UpdateLeds();
#endif

    /* Measures the actual ILO frequency and compensate MSCLP wake up timers */
    Cy_CapSense_IloCompensate(&cy_capsense_context);

    /* Configure the MSCLP wake up timer as per the ACTIVE mode refresh rate */
    Cy_CapSense_ConfigureMsclpTimer(ACTIVE_MODE_TIMER, &cy_capsense_context);


    for (;;)
    {
        switch(appState)
        {
            /* Active Refresh-rate Mode */
            case ACTIVE_MODE:

                Cy_CapSense_ScanAllSlots(&cy_capsense_context);

                interruptStatus = Cy_SysLib_EnterCriticalSection();

                while (Cy_CapSense_IsBusy(&cy_capsense_context))
                {
                    Cy_SysPm_CpuEnterDeepSleep();

                    Cy_SysLib_ExitCriticalSection(interruptStatus);
                    interruptStatus = Cy_SysLib_EnterCriticalSection();
                }
                Cy_SysLib_ExitCriticalSection(interruptStatus);

#if ENABLE_RUN_TIME_MEASUREMENT
                activeModeRunTime = 0u;
                StartRuntimeMeasurement();
#endif
                Cy_CapSense_ProcessAllWidgets(&cy_capsense_context);

                /* Scan, process and check the status of the all Active mode sensors */
                if(Cy_CapSense_IsAnyWidgetActive(&cy_capsense_context))
                {
                    appStateTimeoutCount = TIMEOUT_RESET;
                }
                else
                {
                    appStateTimeoutCount++;

                    if(ACTIVE_MODE_TIMEOUT < appStateTimeoutCount)
                    {
                        appState = ALR_MODE;
                        appStateTimeoutCount = TIMEOUT_RESET;

                        /* Configure the MSCLP wake up timer as per the ALR mode refresh rate */
                        Cy_CapSense_ConfigureMsclpTimer(ALR_MODE_TIMER, &cy_capsense_context);
                    }
                }

#if ENABLE_RUN_TIME_MEASUREMENT
                activeModeRunTime = StopRuntimeMeasurement();
#endif
                break;
                /* End of ACTIVE_MODE */

