Infineon/mtb-example-psoc4-msclp-capsense-lp-proximity/main.c
    /* Set the CAPSENSE data structure as the I2C buffer to be exposed to the
     * master on primary slave address interface. Any I2C host tools such as
     * the Tuner or the Bridge Control Panel can read this buffer but you can
     * connect only one tool at a time.
     */
    Cy_SCB_EZI2C_SetBuffer1(CYBSP_EZI2C_HW, (uint8_t *)&cy_capsense_tuner,
                            sizeof(cy_capsense_tuner), sizeof(cy_capsense_tuner),
                            &ezi2cContext);

    Cy_SCB_EZI2C_Enable(CYBSP_EZI2C_HW);
}

/*******************************************************************************
* Function Name: Ezi2cIsr
********************************************************************************
* Summary:
* Wrapper function for handling interrupts from EZI2C block.
*
*******************************************************************************/
static void Ezi2cIsr(void)
{
    Cy_SCB_EZI2C_Interrupt(CYBSP_EZI2C_HW, &ezi2cContext);
}

/*******************************************************************************
* Function Name: RegisterCallback
********************************************************************************
*
* Summary:
*  Register Deep Sleep callbacks for EzI2C, SPI components
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void RegisterCallback(void)
{
    /* Register EzI2C Deep Sleep callback */
    Cy_SysPm_RegisterCallback(&ezi2cCallback);

#if ENABLE_SPI_SERIAL_LED
    /* Register SPI Deep Sleep callback */
    Cy_SysPm_RegisterCallback(&spiCallback);
#endif

    /* Register Deep Sleep callback */
    Cy_SysPm_RegisterCallback(&deepSleepCb);
}

/*******************************************************************************
* Function Name: DeepSleepCallback
********************************************************************************
*
* Summary:
* Deep Sleep callback implementation. Waits for the completion of SPI transaction.
* And change the SPI GPIOs to highZ while transition to deep-sleep and vice-versa
*
* Parameters:
*  callbackParams: The pointer to the callback parameters structure cy_stc_syspm_callback_params_t.
*  mode: Callback mode, see cy_en_syspm_callback_mode_t
*
* Return:
*  Entered status, see cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t DeepSleepCallback(
        cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retValue = CY_SYSPM_FAIL;

    switch (mode)
    {
        case CY_SYSPM_CHECK_READY:

            retValue = CY_SYSPM_SUCCESS;
            break;

        case CY_SYSPM_CHECK_FAIL:

            retValue = CY_SYSPM_SUCCESS;
            break;

        case CY_SYSPM_BEFORE_TRANSITION:

            #if ENABLE_SPI_SERIAL_LED
            /* SPI pins drive mode to Analog HighZ */
            Cy_GPIO_SetDrivemode(CYBSP_SPI_MOSI_PORT, CYBSP_SPI_MOSI_PIN, CY_GPIO_DM_ANALOG);
            #endif

            retValue = CY_SYSPM_SUCCESS;
            break;

        case CY_SYSPM_AFTER_TRANSITION:

            #if ENABLE_SPI_SERIAL_LED
            /* SPI pins drive mode to Strong */
            Cy_GPIO_SetDrivemode(CYBSP_SPI_MOSI_PORT, CYBSP_SPI_MOSI_PIN, CY_GPIO_DM_STRONG_IN_OFF);
            #endif

            retValue = CY_SYSPM_SUCCESS;
            break;

        default:
            /* Don't do anything in the other modes */
            retValue = CY_SYSPM_SUCCESS;
            break;
    }
    return retValue;
}

#if ENABLE_RUN_TIME_MEASUREMENT
/*******************************************************************************
* Function Name: StartRuntimeMeasurement
********************************************************************************
* Summary:
*  Initializes the system tick counter by calling Cy_SysTick_Clear() API.
*******************************************************************************/
static void StartRuntimeMeasurement()
{
    Cy_SysTick_Clear();
}

/*******************************************************************************
* Function Name: StopRuntimeMeasurement
********************************************************************************
* Summary:
*  Reads the system tick and converts to time in microseconds(us).
*
*  Returns:
*  runTime - in microseconds(us)
*******************************************************************************/

static uint32_t StopRuntimeMeasurement()
{
    uint32_t ticks;
    uint32_t runTime;
    ticks = Cy_SysTick_GetValue();
    ticks = (SYS_TICK_MAX_INTERVAL - Cy_SysTick_GetValue());
    runTime = (ticks * TIME_PER_TICK_IN_US);
    return runTime;
}
#endif

#if ENABLE_SPI_SERIAL_LED
/*******************************************************************************
* Function Name: UpdateLeds
********************************************************************************
* Summary:
*  Control LEDs in the kit to show the proximity, touch and liquid active status:
*   No Proximity/Touch : LED1 & LED2 = OFF
*   Proximity          : LED1 = GREEN (with brightness proportional to target 
*                        object distance)
*   Touch              : LED1 = BLUE
*******************************************************************************/
void UpdateLeds(void)
{
    /* Brightness of each LED is represented by 0 to 255,
    * where 0 indicates LED in OFF state and 255 indicate maximum
    * brightness of an LED
    */
    uint8_t proxLedBrightness = 0u;
    uint16_t proxMaxRawCount = 0u;
    uint16_t maxDiffCount = 0u;

    uint32_t proxSensorStatus = Cy_CapSense_IsProximitySensorActive(CY_CAPSENSE_PROXIMITY0_WDGT_ID, CY_CAPSENSE_PROXIMITY0_SNS0_ID, &cy_capsense_context);

    // /* Initialize LED values */
    ledContext.serialLedData[LED1].green = 0u;
    ledContext.serialLedData[LED1].blue = 0u;

    /* LED1 and LED2 Control: Check the status of Active mode sensors (proximity sensor) and control LED1 and LED2 accordingly */

        if(proxSensorStatus == PROX_STATE)
        {
            /* Calculate proximity status LED brightness based on target object/hand distance from sensor */
            proxMaxRawCount = cy_capsense_tuner.widgetContext[CY_CAPSENSE_PROXIMITY0_WDGT_ID].maxRawCount;
            maxDiffCount = proxMaxRawCount - cy_capsense_tuner.sensorContext[CY_CAPSENSE_PROXIMITY0_SNS0_ID].bsln;
            proxLedBrightness = (uint8_t)((uint32_t)(cy_capsense_tuner.sensorContext[CY_CAPSENSE_PROXIMITY0_SNS0_ID].diff*255)/maxDiffCount);

            /* LED1 (GREEN) Turns on when proximity is detected */
            ledContext.serialLedData[LED1].green = proxLedBrightness;
        }
        else if(proxSensorStatus >= TOUCH_STATE)
        {
            /* LED1 (GREEN) Turns on when proximity is detected */
            ledContext.serialLedData[LED1].green = 0;

            /* LED2 (BLUE) Turns on when touch is detected */
            ledContext.serialLedData[LED1].blue = SERIAL_LED_BRIGHTNESS_MAX;
        }

    ProcessSerialLed(&ledContext);
}
#endif

/* [] END OF FILE */
